In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import json
import datetime
import seaborn
import requests

In [ ]:
api
data=json.loads(api)

for obj in data['obj']:
    obj.

In [2]:
df=pd.read_csv('Employee - Sheet1.csv')
df.head()

   EID       Name        Role  Manager  Leaves  Rating
0    1     Adarsh          HR  Nishant       3       4
1    2    Nishant     Manager      NaN       5       3
2    3     Hasifa          IT  Sanjana       2       3
3    4  Yasaswini  Operations      NaN       5       4
4    5    Sanjana          IT      NaN       8       5

In [3]:
df['Manager'].fillna('None',inplace=True)
df.head()

   EID       Name        Role  Manager  Leaves  Rating
0    1     Adarsh          HR  Nishant       3       4
1    2    Nishant     Manager     None       5       3
2    3     Hasifa          IT  Sanjana       2       3
3    4  Yasaswini  Operations     None       5       4
4    5    Sanjana          IT     None       8       5

In [5]:
avg_ratings=df['Rating'].mean()
avg_leaves=df['Leaves'].mean()
print("Average Employee Ratings = ",int(avg_ratings))
print("Average Number of Leaves = ",int(avg_leaves))

Average Employee Ratings =  3
Average Number of Leaves =  5